Revit 2027 API
IFCLevelInfo.GetRelatedElements Method
 Gets all building elements on this level.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<IFCAnyHandle> GetRelatedElements()
Public Function GetRelatedElements As ICollection(Of IFCAnyHandle)
public:
ICollection<IFCAnyHandle^>^ GetRelatedElements()
member GetRelatedElements : unit -> ICollection<IFCAnyHandle>
Return Value
ICollection<IFCAnyHandle>
 The collection of elements.
See Also
Reference
IFCLevelInfo Class
Autodesk.Revit.DB.IFC Namespace